/* 
  Localizable.strings (English)
  AMD Power Gadget
*/

/* NOTE: Some keys use Spanish text for historical reasons. */
/* These are used as lookup identifiers and work correctly. */
/* A future refactor should standardize all keys to English. */

"Dashboard" = "Pulpit";
"Telemetry" = "Telemetria";
"Fan Control" = "Kontrola wentylatora";
"Profiles" = "Profiles";
"Advanced" = "Zaawansowane";
"Menu Bar" = "Pasek menu";
"System Info" = "Informacje o systemie";
"Desktop Widgets" = "Widgety desktopowe";

"AMD Power" = "Moc AMD";
"Gadget" = "Gadget";

"CPU" = "Procesor";
"GPU" = "GPU";
"Freq" = "Częstotliwość";
"Average" = "Średnia";
"Avg: %@" = "Średnia: %@";
"Collecting data…" = "Zbieranie danych…";

"Low Power Mode (LPM)" = "Tryb niskiego zużycia energii (LPM)";
"Allows macOS to auto-manage CPU frequency" = "Pozwala macOS na automatyczne zarządzanie częstotliwością procesora";
"Forces CPU to lowest frequency for minimum power" = "Zmusza procesor do najniższej częstotliwości dla mocy minimalnej";
"Core Performance Boost (CPB)" = "Podstawowe zwiększenie wydajności (CPB)";
"Update Interval" = "Interwał aktualizacji";
"Adjust how frequently telemetry data updates. Lower = more responsive, higher = less CPU usage." = "Dostosuj jak często aktualizuje dane telemetryczne. Niższe = bardziej responsywne, wyższe = mniejsze zużycie procesora.";

"Opciones en Menú Bar" = "Opcje paska menu";
"Choose which items appear in the menu bar. Changes apply immediately." = "Wybierz elementy, które pojawią się na pasku menu. Zmiany mają natychmiastowe zastosowanie.";
"Customize the visual appearance of the menu bar items." = "Dostosuj wygląd wizualny elementów paska menu.";
"Límite de Temp de Alerta" = "Limit czasu alertu";
"Color de Alerta de Temp" = "Kolor powiadomień";
"Color de Flechas" = "Kolor strzałek";
"Additional telemetry for the menu bar." = "Dodatkowa telemetria na pasku menu.";
"GPU data is shown inside Temp, Power, Memory and Fan columns when enabled." = "Dane GPU są wyświetlane wewnątrz kolumn Temp, Power, Pamięć i Fan, gdy włączone.";
"Show GPU VRAM" = "Pokaż VRAM GPU";
"G:X.XG in Memory column" = "G:X.XG w kolumnie Pamięć";
"Show GPU Fan Speed" = "Pokaż prędkość wentylatora GPU";
"G:XXXX in Fan column" = "G:XXXX w kolumnie wentylatora";

"No fans detected." = "Nie wykryto wentylatorów.";
"SMC driver not available" = "Sterownik SMC niedostępny";
"Your SMC chip may not be supported." = "Twój chip SMC może nie być obsługiwany.";
"RPM" = "RPM";
"Throttle" = "Przepustnica";
"↩ Reset to Auto" = "↩️ Resetuj do Auto";

"Select a profile to adjust the CPU operating range. Changes take effect immediately." = "Wybierz profil, aby dostosować zakres działania procesora. Zmiany stają się natychmiastowe.";

"Directly edit raw P-State registers. Requires kext privilege check disabled via boot-arg or root." = "Bezpośrednio edytuj surowe rejestry P-state . Wymaga wyłączonego sprawdzania uprawnień kext przez boot-arg lub root.";
"This will write the raw P-State definitions directly to the CPU. Proceed?" = "Spowoduje to zapisanie surowych definicji P-State bezpośrednio do CPU. Kontynuować?";
"Disabled — work in progress" = "Wyłączone – praca w toku";
"WIP" = "WIP";

"Enable in OC: Misc → Security → ExposeSensitiveData = 0x08" = "Włącz w OC: Różne → Bezpieczeństwo → ExposeSensitiveData = 0x08";
"Motherboard info not available" = "Informacje o płycie głównej nie są dostępne";

"Vista previa de la Barra de Menús:" = "Podgląd paska menu:";
"Ancho estimado: %dpt" = "Szacowana szerokość: %dpkt";
"Restart the app to fully apply width changes." = "Uruchom ponownie aplikację, aby w pełni zastosować zmiany szerokości.";
"Small (%dpt)" = "Mały (%dpt)";
"Medium (%dpt)" = "Średni (%dpt)";
"Large (%dpt)" = "Duży (%dpt)";

"Green" = "Zielony";
"Blue" = "Niebieski";
"Orange" = "Pomarańczowy";
"Red" = "Czerwony";
"Purple" = "Fioletowy";
"Pink" = "Różowy";
"Teal" = "Turkusowy";
"Turquoise" = "Turquoise";

"Verde" = "Zielony";
"Azul" = "Niebieski";
"Naranja" = "Pomarańczowy";
"Rojo" = "Czerwony";
"Morado" = "Fioletowy";
"Rosa" = "Różowy";
"Turquesa" = "Turkusowy";

"Dynamic Colors (Temp Only)" = "Dynamiczne kolory (Temp tylko)";
"Temp Alert Color" = "Kolor powiadomienia tymczasowego";
"Temp Alert Limit" = "Limit powiadomień tymczasowych";
"Network" = "Sieć";
"Network Arrows Color" = "Kolor strzałek sieci";
"Exit" = "Wyjście";
"AMD Power Gadget" = "Gadżet Moc AMD";
"AMD Power Tool" = "Narzędzie zasilania AMD";
"SMC Fans" = "Wentylatory SMC";

"Fan 1" = "Wentylator 1";
"Fan 2" = "Wentylator 2";
"Fan 3" = "Wentylator 3";
"Fan 4" = "Wentylator 4";
"Fan 5" = "Wentylator 5";
"Fan 6" = "Wentylator 6";
"Fan 7" = "Wentylator 7";
"Fan 8" = "Wentylator 8";

/* Alerts */
"To enable motherboard display:" = "Aby włączyć wyświetlanie płyty głównej:";
"Open your OpenCore config file,\n\nGo to Misc -> Security -> ExposeSensitiveData,\n\nSet the value to 0x08 to expose board information." = "Otwórz plik konfiguracyjny OpenCore\n\nPrzejdź do Misc -> Security -> ExposeSensitiveData,\n\nUstaw wartość 0x08 aby wyświetlić informacje działu.";
"Done" = "Gotowe";
"Invalid Input" = "Invalid Input";
"Please type in numbers in hexadecimal." = "Wpisz liczbę w układzie szesnastkowym.";
"Unable to Set PStateDef" = "Nie można ustawić PStateDef";
"Action was denied as current user does not have enough privilege,\nor was canceled by current user.\n\nRun AMD Power Gadget as root user or disable privilege check with boot-arg '-amdpnopchk'\n\nOtherwise, click 'Once' in the warning message to allow this change." = "Akcja została odrzucona, ponieważ bieżący użytkownik nie ma wystarczających uprawnień,\nlub został anulowany przez bieżącego użytkownika.\n\nUruchom Gadżet AMD Power jako użytkownik główny lub wyłącz sprawdzanie uprawnień z boot-arg '-amdpnopchk'\n\nW przeciwnym razie, kliknij 'Jedna' w wiadomości ostrzegawczej, aby zezwolić na tę zmianę.";
"Your changes will not be saved" = "Twoje zmiany nie zostaną zapisane";
"Click apply to save changes before closing this windows." = "Kliknij przycisk Zastosuj, aby zapisać zmiany przed zamknięciem tego okna.";
"Cancel" = "Anuluj";
"Close without saving" = "Zamknij bez zapisywania";
"Invalid File" = "Nieprawidłowy plik";
"The selected file could not be read or is not a valid pstate file." = "Wybrany plik nie może zostać odczytany lub nie jest prawidłowym plikiem pstat.";
"OK" = "OK";

/* Dynamic format strings */
"Avg: %.2f GHz, Max: %.2f GHz" = "Avg: %.2f GHz, Max: %.2f GHz";
"%.2f °C" = "%.2f °C";
"%.2f Watt" = "%.2f W";

/* Session Peaks */
"Session Peaks" = "Piki sesji";
"Reset Peaks" = "Resetuj szczyty";

/* GPU Fan Control */
"GPU Fan Control (Zero RPM / Curves)" = "Sterowanie fanem GPU (Zero RPM / Krzywy)";
"macOS Hardware Limitation" = "Ograniczenie sprzętowe macOS";
"Direct software-based GPU fan speed overrides (such as zero-rpm toggle or drawing fan curves in macOS) are not supported by the macOS kernel/IOKit driver for AMD GPUs. The GPU's onboard firmware (vBIOS) manages the fans." = "Bezpośrednie nadpisywanie prędkości wentylatora GPU oparte na oprogramowaniu (takie jak przełącznik zerowego obr./min lub krzywe wentylatorów w macOS) nie jest obsługiwane przez sterownik kernel/IOKit dla GPU AMD. Pokładowe oprogramowanie graficzne (vBIOS) zarządza fanami.";
"Standard Hackintosh Solution:" = "Roztwór wzorcowy Hackintosa:";
"The only way to modify this behavior (like forcing fans to spin at lower temperatures or disabling Zero RPM) is by exporting the vBIOS, creating a Soft PowerPlay Table (SPPT), and injecting it via OpenCore's config.plist under DeviceProperties." = "Jedynym sposobem na modyfikację tego zachowania (jak zmuszanie wentylatorów do ustawiania się w niższych temperaturach lub wyłączanie Zero RPM) jest eksport vBIOS, tworzenie tabeli Soft PowerPlay (SPPT) i wstrzykiwanie jej za pomocą konfiguracji OpenCore. lista pod WłaściwościUrządzenia.";
"Open SPPT Guide" = "Otwórz przewodnik SPPT";
"MorePowerTool" = "WięcejPower Tool";

/* CPPC & EPP */
"Native CPPC Active Mode (EPP)" = "Natywny tryb aktywny CPPC (EPP)";
"Enables autonomous hardware frequency scaling (recommended)" = "Włącza autonomiczne skalowanie częstotliwości sprzętowych (zalecane)";
"Power Management Mode" = "Tryb zarządzania zasilaniem";
"Energy Preference (EPP)" = "Preferencje energetyczne (PPP)";
"Select a hardware autonomous profile. The CPU will scale frequency dynamically." = "Wybierz profil autonomiczny sprzętu. CPU będzie skalować częstotliwość dynamicznie.";
"Performance" = "Efektywność";
"Balanced Perf" = "Zrównoważone Perf";
"Balanced Power" = "Zrównoważona Moc";
"Power Save" = "Oszczędzanie energii";
"Active Profile Status" = "Aktywny status profilu";
"CPU Speed Profiles (Legacy)" = "Profile szybkości procesora (Legacy)";
"Select a manual P-State override profile. Frequencies will be restricted to the selected step." = "Wybierz ręczne nadpisywanie profilu. Częstości będą ograniczone do wybranego kroku.";
"Mode" = "Tryb";
"EPP Profile" = "Profil EPP";

/* Desktop Widgets */
"Show CPU Widget" = "Pokaż widżet CPU";
"Show GPU Widget" = "Pokaż widżet GPU";
"Show RAM Widget" = "Show RAM Widget";
"Show Disk Widget" = "Pokaż widżet dysku";
"Show Network Widget" = "Pokaż widżet sieci";
"Show Fan Widget" = "Pokaż widżet wentylatora";
"Disable All Widgets" = "Wyłącz wszystkie widżety";
"Sort by Rank" = "Sortuj według Rangi";
"Edit Widget Layout" = "Edytuj układ widżetu";
"Unlock widgets to drag them around the screen" = "Odblokuj widżety, aby przeciągać je po ekranie";
"Widget Options" = "Opcje widżetu";
"Customize the appearance and behavior of your desktop widgets." = "Dostosuj wygląd i zachowanie widżetów pulpitu.";
"Auto-Align Active Widgets" = "Automatycznie wyrównaj aktywne widżety";
"Automatically stack active widgets at a corner" = "Automatycznie ustawiaj aktywne widżety w rogu";
"Alignment Corner" = "Narożnik wyrównania";
"Top Right" = "Prawy górny róg";
"Top Left" = "Lewy górny";
"Bottom Right" = "Prawy dolny róg";
"Bottom Left" = "Lewy dolny róg";
"Show Clock Widget" = "Pokaż widżet zegara";
"Clock" = "Zegar";
"Stats Table" = "Tabela statystyk";
"Classic Glass" = "Klasyczne szkło";
"Pro Monitor" = "Pro Monitor";
"Core Matrix" = "Podstawowa Matryca";

"United" = "Stany Zjednoczone";
"Show United Widget" = "Pokaż United Widget";
"Configure Combined Metrics" = "Konfiguruj skojarzone metryki";
"Include CPU" = "Dołącz procesor";
"Include GPU" = "Dołącz GPU";
"Include RAM" = "Dołącz RAM";
"Include Disk" = "Dołącz Dysk";
"Include Network" = "Dołącz sieć";
"Include Fan" = "Dołącz wentylator";

"Temas & Apariencia" = "Motywy i wygląd";
"Análisis" = "Analiza";

"Select Visual Theme (Instant Application)" = "Wybierz motyw wizualny (aplikacja natychmiastowa)";
"Custom Theme Creator & Exchange (JSON)" = "Własny twórca i wymiana motywów (JSON)";
"Chart Rendering Style" = "Styl renderowania map";
"Custom Theme Editor" = "Niestandardowy edytor motywu";
"Showing active theme colors. Adjust any color to customize." = "Wyświetlanie aktywnych kolorów motywu. Dostosuj dowolny kolor do dostosowania.";
"Use the Opacity slider for transparency (macOS color panel alone often resets alpha)." = "Użyj suwaka przezroczystości (panel kolorów macOS często resetuje alfa).";
"Opacity" = "Przezroczystość";
"Edit Active Theme" = "Edytuj aktywny motyw";
"Export Theme (JSON)" = "Eksportuj motyw (JSON)";
"Import Theme (JSON)" = "Importuj motyw (JSON)";
"Card Background" = "Tło karty";
"Cyan Accent" = "Błękitny akcent";
"Orange Accent" = "Pomarańczowy akcent";
"Green Accent" = "Zielony akcent";
"Purple Accent" = "Fioletowa akcent";

/* ===== Auto-extracted / curated for Crowdin (v3.16.1+) ===== */
"%.0f" = "%.0f";
"%.0f K/s" = "%.0f K/s";
"%.0f MHz" = "%.0f MHz";
"%.0f%%" = "%.0f%%";
"%.0fG" = "%.0fG";
"%.0f°" = "%.0f°";
"%.0f°C" = "%.0f°C";
"%.0f°C • %.0fW" = "%.0f°C • %.0fW";
"%.1f %@" = "%.1f %@";
"%.1f Ghz" = "%.1f Ghz";
"%.1f M/s" = "%.1f M/s";
"%.1f s" = "%.1f s";
"%.1f%%" = "%.1f%%";
"%.1f°C" = "%.1f°C";
"%.2f GHz" = "%.2f GHz";
"%.3f V" = "%.3f V";
"%.4f V" = "%.4f V";
"100°C" = "100 °C";
"1h" = "1h";
"24h" = "24h";
"30d" = "30d";
"60°C" = "60°C";
"7d" = "7d";
"Accept & Continue" = "Zaakceptuj i kontynuuj";
"Active" = "Aktywne";
"All Auto" = "Wszystkie auto";
"All Combined" = "Wszystkie połączone";
"All Fans Auto" = "Auto wszystkie wentylatory";
"AMD CPU Cores" = "Rdzenie procesora AMD";
"AMD Power Gadget recolecta datos automáticamente cada minuto." = "Gadżet Moc AMD automatycznie z danymi odzyskiwania.";
"AMD Processor Power Manager (PPM)" = "Menedżer zasilania procesora AMD (PPM)";
"Analysis" = "Analiza";
"Apply" = "Zastosuj";
"Apply P-States?" = "Zastosuj P?";
"Arrange the order in which resource widgets appear. Click arrows to swap position." = "Uporządkuj kolejność wyświetlania widżetów zasobów. Kliknij strzałki, aby zamienić pozycję.";
"Arrow Color" = "Kolor strzałki";
"Automatically switches EPP profiles based on live CPU load" = "Automatycznie przełącza profile EPP na podstawie obciążenia CPU";
"Average core frequency in GHz" = "Średnia częstotliwość rdzenia w GHz";
"Average utilization over time" = "Średnie wykorzystanie w czasie";
"Avg Frequency" = "Średnia częstotliwość";
"Avg." = "Śr.";
"Avg: %.0f%%" = "Średnia: %.0f%%";
"Balanced\n%.1f GHz" = "Balanced\n%.1f GHz";
"Base\n%.1f GHz" = "Bazowa\n%.1f GHz";
"BIOS / Auto" = "BIOS / Auto";
"Buscando actualizaciones..." = "Buscando actualizaciones...";
"Bytes (Read)" = "Bajty (Czyta)";
"Bytes (Write)" = "Bajty (rytu)";
"Cargando tendencias de telemetría..." = "Cargando tendencias de telemetría...";
"Chart Metric" = "Metryka wykresu";
"Chart Type" = "Typ wykresu";
"Charts require macOS 13+" = "Wykresy wymagają macOS 13+";
"Charts require macOS 13.0+" = "Wykresy wymagają macOS 13.0+";
"Check for new releases of SMCAMDProcessor and AMD Power Gadget on GitHub." = "Sprawdź nowe wydania Gadżetu SMCAMDProcessor i AMD Power na GitHub.";
"Check for Updates" = "Sprawdź aktualizacje";
"Check Now" = "Sprawdź teraz";
"Circular Ring" = "Pierścień okrągły";
"Column Bars" = "Paski kolumn";
"Configure Charts" = "Skonfiguruj mapy";
"Configure labels and layout details for widgets inside the popover." = "Skonfiguruj etykiety i szczegóły układu widżetów wewnątrz wyskakującego okna.";
"Connection Error: %@" = "Błąd połączenia: %@";
"Continuous Background Logging" = "Rejestrowanie ciągłe w tle";
"Continuously write telemetry samples to a CSV file in the background" = "Ciągle zapisuj próbki telemetrii do pliku CSV w tle";
"Control Mode" = "Tryb sterowania";
"Core Rankings (Estimated by Freq)" = "Podstawowe rankingi (Estimated by Freq)";
"Could not fetch release info." = "Nie można pobrać informacji o wydaniu.";
"CPPC hardware rankings are active and loaded from the processor." = "Rankingi sprzętu CPPC są aktywne i załadowane z procesora.";
"CPPC hardware values could not be read. Rankings are estimated from the maximum observed clock frequency of each core." = "Nie można odczytać wartości sprzętu CPPC. Rankingi są szacowane na podstawie maksymalnej obserwowanej częstotliwości zegara każdego rdzenia.";
"CPPC Preferred Cores (Silicon Quality)" = "Preferowane rdzenie CPPC (Silicon Quality)";
"CPPC: Active" = "CPPC: HW OK";
"CPPC: Estimated" = "CPPC: Szacowany";
"CPU and GPU temperatures" = "Temperatury procesora i GPU";
"CPU Average Frequency" = "Średnia częstotliwość procesora";
"CPU Freq Avg (GHz)" = "Procesor Freq Avg (GHz)";
"CPU Frequency" = "Częstotliwość procesora";
"CPU Load" = "Obciążenie procesora";
"CPU Load (%)" = "Obciążenie procesora (%)";
"CPU Package Power" = "Moc pakietu CPU";
"CPU Per-Core Thread Load" = "Obciążenie tematów CPU dla rdzenia";
"CPU Power" = "Moc procesora";
"CPU Power (W)" = "Moc procesora (W)";
"CPU Power Alert" = "Alarm mocy procesora";
"CPU power has been at %.1fW (above limit of %dW) for over %d seconds!" = "Moc CPU była w %.1fW (powyżej limitu %dW) przez %d sekund!";
"CPU Temp" = "Temperatura procesora";
"CPU Temp (°C)" = "Temperatura procesora (°C)";
"CPU Temperature" = "Temperatura procesora";
"CPU Temperature Alert" = "Alarm temperatury procesora";
"CPU temperature has reached %.1f°C!" = "Temperatura procesora osiągnęła %.1f°C!";
"CPU Tracker" = "Tracker procesora";
"Current version: v%@\nNew version: %@\n\nRelease Notes:\n%@" = "Obecna wersja: v%@\nNowa wersja: %@\n\nNotatki:\n%@";
"Curve" = "Krzywa";
"Curve Optimizer is only active when the AMDRyzenCPUPowerManagement kext supports Zen 3 SMU mailbox interface." = "Krzywa Optimizer jest aktywna tylko wtedy, gdy AMDRyzenCPUPowerManagement kext obsługuje interfejs Zen 3 SMU skrzynki pocztowej.";
"Custom" = "Własny";
"Customize the behavior and visibility of the menu bar popover." = "Dostosuj zachowanie i widoczność wyskakującego paska menu.";
"Cyberpunk Neon" = "Cyberpunk Neon";
"Delete Point" = "Usuń punkt";
"Device Utilization %" = "Wykorzystanie urządzenia %";
"Disable heavy visual effects if your system lacks Metal graphics acceleration." = "Wyłącz ciężkie efekty wizualne, jeśli system nie posiada przyspieszenia grafiki.";
"DISCLAIMER: This software interacts directly with low-level hardware control registers. By using it, you agree that absolute responsibility for any system instability, hardware damage, or alien invasion lies entirely with the user." = "DISCLAIMER: To oprogramowanie działa bezpośrednio z rejestrami kontroli sprzętu niskiego poziomu. Używając tego, zgadzasz się, że bezwzględna odpowiedzialność za niestabilność systemu, obrażenia sprzętowe lub inwazję obcych spoczywa wyłącznie na użytkowniku.";
"DISCLAIMER: This software interacts directly with low-level hardware control registers. By using it, you agree that absolute responsibility rests entirely with the user." = "DISCLAIMER: To oprogramowanie wchodzi bezpośrednio w interakcje z rejestrami sterowania sprzętem niskiego poziomu. Korzystając z niego, zgadzasz się, że całkowita odpowiedzialność spoczywa całkowicie na użytkowniku.";
"Disk" = "Dysk";
"DISK" = "WYBIERZ";
"Disk Activity" = "Aktywność dysku";
"Disk Activity (MB/s)" = "Aktywność dysku (MB/s)";
"Disk Activity (Read+Write)" = "Aktywność dysku (odczyt + zapis)";
"Disk I/O" = "Dysk I/O";
"Disk Tracker" = "Śledzenie dysku";
"Do you want AMD Power Gadget to start in menu bar at login? \n\n This will only be asked once. You can change this setting later under Appearance menu." = "Czy chcesz, aby Gadżet Moc AMD zaczęła się na pasku menu podczas logowania? \n\n Zostanie to zadane tylko raz. Możesz zmienić to ustawienie później w menu Wyglądu.";
"Donate (PayPal)" = "Darowizna (PayPal)";
"Download" = "Pobierz";
"Download on GitHub" = "Pobierz na GitHub";
"Download Update" = "Pobierz aktualizację";
"Drag control points to edit curve. Double-click empty space to add (max 8). Double-click a point or right-click to delete." = "Przeciągnij punkty kontrolne, aby edytować krzywą. Kliknij dwukrotnie pustą przestrzeń, aby dodać (maksymalnie 8). Kliknij dwukrotnie punkt lub kliknij prawym przyciskiem myszy, aby usunąć.";
"Dynamic Auto-EPP Workload Engine" = "Dynamiczny silnik pracy Auto-EPP";
"Dynamic Next-Gen Fan Curves" = "Dynamiczne Krzywe wentylatora Next-Gen";
"Edit Layout" = "Edytuj układ";
"Efficient\n%.1f GHz" = "Efektywne\n%.1f GHz";
"Enable additional stats columns inside the popover." = "Włącz dodatkowe kolumny statystyk wewnątrz wyskakującego okna.";
"Enable System Alerts" = "Włącz powiadomienia systemowe";
"Error reading CPU data." = "Błąd odczytu danych procesora.";
"Evaluated in the kernel with 256-step LUT interpolation, hysteresis, and smooth ramping." = "Oceniana w jądrze z 256-stopniową interpolacją LUT, histerezą i gładkim skurczem.";
"Export" = "Eksportuj";
"Export CSV" = "Eksportuj CSV";
"Export Telemetry History" = "Eksportuj historię telemetrii";
"Export the history of samples currently in memory to a CSV file" = "Eksportuj historię próbek obecnie w pamięci do pliku CSV";
"Failed — check kext privileges (-amdpnopchk)." = "Nie powiodło się — sprawdź uprawnienia kext (-amdpnopchk).";
"Fan" = "Wentylator";
"Fan Number" = "Numer wentylatora";
"Fan Speed" = "Prędkość wentylatora";
"Fan Speed (RPM)" = "Prędkość wentylatora (RPM)";
"Fan Speed(RPM)" = "Prędkość wentylatora (RPM)";
"Filled Area" = "Wypełniony obszar";
"Freq:" = "Freq:";
"Frequency" = "Częstotliwość";
"Frequency Max:" = "Maksymalna częstotliwość:";
"GHz" = "W pozycji 3A001.e.1 „oprogramowanie” specjalnie zaprojektowane lub zmodyfikowane do „rozwoju”, „produkcji” lub „użytkowania” sprzętu lub „oprogramowania” wyszczególnionych w pozycji 3A001.e.2, 3A001.e.2, 3A001.e.3, 3A001.e.3, 3A001.e.3, 3A001.e.3, 3A001.e.3, 3A001.e.3, 3A001.e.3, 3A001.e.3, 3A001.e.3, 3A001.e.3, 3A001.e.3, 3A001.e.3, 3A001.a.3, 3A001.a.3, 3A001.a.3, 3A001.a.5, 3A001.a.6, 3A001.a.6, 3A001.a.6, 3A001.a.6, 3A001.a.10, 3A001.a.10, 3A001.a.10, 3A001.a.10, 3A001.a.10, 3A001.a.10, 3A001.a.10, 3A001.a.10, 3A001.a.10, 3A001.a.10, 3A001.a.10, 3A001.a.10, 3A001.a.10, 3A001.a.10, 3A001.a.10, 3A001.a.10, 3A001.a.10, 3A001.a.10, 3A001.a.10, 3A001.";
"GitHub Repository" = "GitHub Repository";
"GitHub Repository\n\nSpecial thanks to the AMD OS X community!\n\nCopyright © 2020-2026 Droga. All rights reserved." = "GitHub Repository\n\nSpecjalne podziękowania dla społeczności AMD OS X!\n\nCopyright ©️ 2020-2026 Droga. Wszystkie prawa zastrzeżone.";
"GPU Load" = "Obciążenie GPU";
"GPU Model" = "Model GPU";
"GPU Power" = "Moc GPU";
"GPU Power (W)" = "Moc GPU (W)";
"GPU Temp" = "Temperatura GPU";
"GPU Temp (°C)" = "Temperatura GPU (°C)";
"GPU Temperature" = "Temperatura GPU";
"GPU Tracker" = "Śledzenie GPU";
"H.264 & HEVC Active" = "H.264 i HEVC Aktywne";
"H.264 Active (HEVC Inactive)" = "Aktywne H.264 (HEVC nieaktywne)";
"HEVC Active (H.264 Inactive)" = "HEVC aktywny (H.264 nieaktywny)";
"Hide this fan" = "Ukryj ten wentylator";
"High Load Threshold (Performance)" = "Próg dużego obciążenia (Performance)";
"Histograma de Barras" = "Histograma de Barras";
"Hysteresis" = "Hysteresis";
"I accept that absolute responsibility lies entirely with the user." = "Zgadzam się, że bezwzględna odpowiedzialność spoczywa w całości na użytkowniku.";
"Idle Threshold (Power Save)" = "Próg bezczynności (Power Zapisz)";
"Import" = "Importuj";
"Inactive" = "Nieaktywny";
"Inactive / Not Supported" = "Nieaktywny / Nieobsługiwany";
"Index" = "Wielkość sprzedaży i udział w rynku";
"Inject positive or negative voltage offsets per core. Center is 0 (no override). Limit: -30 (undervolt) to +30 (overvolt) counts." = "Wstrzyknij kompensacje napięcia dodatniego lub ujemnego na rdzeń. Środek to 0 (brak nadpisywania). Ogranicz: -30 (pod napięciem) do +30 (pod napięciem).";
"Inst(s) Retired:" = "Instalacja przywrócona:";
"Kext Update Available" = "Dostępna aktualizacja Kext";
"Later" = "Później";
"Line Only" = "Tylko wiersz";
"Load" = "Załaduj";
"Loading..." = "Ładowanie...";
"Log File Location" = "Lokalizacja pliku dziennika";
"Logical Cores" = "Rdzenie logiczne";
"Low Performance Mode" = "Tryb niskiej wydajności";
"Low Power\n%.1f GHz" = "Niska moc\n%.1f GHz";
"Línea Escalonada (Step)" = "Eskalonada (tep)";
"Línea Suave (Spline)" = "Suapka Liľnea (pole polskie)";
"Manual Override" = "Ręczne nadpisanie";
"Max Speed" = "Maksymalna prędkość";
"Max." = "Maks.";
"MB/s" = "MB/s";
"Memory Usage" = "Użycie pamięci";
"Menu Bar Preview:" = "Podgląd paska menu:";
"Mi Tema Custom" = "Niestandardowy szablon Mi";
"Min." = "Min.";
"Monochrome Stealth" = "Monochromatyczne stealth";
"Máx." = "Maks.";
"Máx:" = "Maksymalnie:";
"Mín." = "Janusz";
"Mín:" = "crwdns74646:0crwdne74646:0";
"N/A" = "Nie dotyczy.";
"Net" = "Netto";
"Net Download (MB/s)" = "Pobieranie netto (MB/s)";
"Net Upload (MB/s)" = "Wgrywanie sieci (MB/s)";
"Network Speed" = "Prędkość sieci";
"Network Throughput" = "Szerokość sieci";
"Network Total Speed" = "Całkowita prędkość sieci";
"New version %@ available!" = "Dostępna jest nowa wersja %@!";
"New Version Available: %@" = "Dostępna nowa wersja: %@";
"No" = "Nie";
"No AMDRyzenCPUPowerManagement Found!" = "Nie znaleziono AMDRyzenCPUPowerManagement";
"No curves configured." = "Brak skonfigurowanych krzywych";
"No hay suficientes datos recolectados aún." = "No hay suficientes datos recolectados aún.";
"No location selected" = "Nie wybrano lokalizacji";
"No metrics active" = "Brak aktywnych metryk";
"No release notes available." = "Brak dostępnych informacji o wydaniu.";
"Nordic Frost" = "Nordycki Mróz";
"Not Supported" = "Nieobsługiwane";
"Not supported by your CPU" = "Nie obsługiwane przez CPU";
"Not yet" = "Jeszcze nie";
"Open Dashboard" = "Otwórz panel";
"Other Popover Widgets" = "Inne widżety Popover";
"P-State Editor" = "Edytor P-State";
"P-States applied successfully." = "P-state zastosowany pomyślnie.";
"P-States Configuration" = "Konfiguracja stanów P";
"Package" = "Pakiet";
"Package Power" = "Moc pakietu";
"Peak Fan" = "Maksymalny wentylator";
"Peak Freq" = "Prędkość szczytowa";
"Peak Power" = "Moc szczytowa";
"Peak Temp" = "Temperatura szczytowa";
"Performance\n%.1f GHz" = "Wydajność\n%.1f GHz";
"Performance & Fallback" = "Wydajność i Fallback";
"Personalizado" = "Personalizado";
"Physical Cores" = "Rdzenie fizyczne";
"Pin Popover Open" = "Otwarte Przypnij Popo";
"Platform" = "Platforma";
"Please download AMDRyzenCPUPowerManagement from the release page." = "Pobierz AMDRyzenCPUPowerManagement ze strony wydania.";
"Popover Config" = "Popover Config";
"Popover General Settings" = "Ustawienia ogólne programu Popover";
"Popover Menu" = "Popover Menu";
"Power" = "Moc";
"Power Warning Threshold (PPT)" = "Próg ostrzegania o energii (PPT)";
"Prevent the popover from closing when clicking outside" = "Zapobiegaj zamykaniu wyskakujących okienek po kliknięciu na zewnątrz";
"Preview" = "Podgląd";
"Processor" = "Procesor";
"Profile" = "Profil";
"Progress Bar" = "Pasek postępu";
"Prom." = "Prom.";
"PWR" = "PWR";
"Quick Fan Access" = "Szybki dostęp wentylatora";
"Quit" = "Wyjdź";
"Quit and Download" = "Wyjdź i Pobierz";
"Radeon GPU" = "Radeon GPU";
"Radeon Graphics utilization percentage" = "Procent wykorzystania grafiki radeonu";
"RAM" = "RAM";
"RAM Tracker" = "Śledzenie RAM";
"RAM Usage" = "RAM Usage";
"RAM Usage (%)" = "RAM Usage (%)";
"RAM Utilization" = "RAM Utilization";
"RAM utilization percentage" = "Procent wykorzystania pamięci RAM";
"Ramp Rate" = "Szybkość na płycie";
"Raw Register Details" = "Szczegóły surowego rejestru";
"Read Speed" = "Prędkość odczytu";
"Real-time energy consumption in Watts" = "Zużycie energii w czasie rzeczywistym w watach";
"Real-time History" = "Historia w czasie rzeczywistym";
"Real-time upload / download speed (↑/↓)" = "Przesyłanie w czasie rzeczywistym / prędkość pobierania (↑/↓)";
"Receive native macOS alerts when the CPU exceeds configured thermal or power limits." = "Otrzymuj natywne powiadomienia macOS, gdy CPU przekracza skonfigurowane limity termiczne lub mocy.";
"Refresh Rate" = "Częstotliwość odświeżania";
"Relative Time (s)" = "Względny czas (s)";
"Replaces translucent blurs with solid colors to save CPU" = "Zastępuje przezroczyste rozmycia litymi kolorami, aby zapisać procesor";
"Requests permission and enables hardware limit warnings" = "Żąda zgody i włącza ostrzeżenia o ograniczeniach sprzętowych";
"Revert" = "Odwróć";
"Right-click any widget directly on your desktop to change its style dynamically (Classic Glass, Pro Monitor, or Core Matrix)." = "Kliknij prawym przyciskiem myszy na dowolny widżet bezpośrednio na swoim komputerze, aby zmienić jego styl dynamicznie (klasyczny szkło, Pro Monitor, lub Core Matrix).";
"SAFETY DISCLAIMER & LIABILITY AGREEMENT" = "UMOWA O UJAWNIENIU BEZPIECZEŃSTWA I ODPOWIEDZIALNOŚCI";
"Seleccioná una gráfica en el panel superior para visualizar su histórico." = "crwdns74848:0crwdne74848:0";
"Select File..." = "Wybierz plik...";
"Select which metrics are shown and choose their visualization style." = "Wybierz, które wskaźniki są wyświetlane i wybierz ich styl wizualizacji.";
"Series" = "Seria";
"Show a floating, non-interactive widget on your desktop for live telemetry." = "Pokaż pływający, nieinteraktywny widżet na pulpicie dla telemetrii na żywo.";
"Show All (%d hidden)" = "Pokaż wszystkie (%d ukryte)";
"Show CPU" = "Pokaż procesor";
"Show Fan RPM" = "Pokaż NCM wentylatora";
"Show GPU Power" = "Pokaż moc GPU";
"Show GPU Row" = "Pokaż wiersz GPU";
"Show GPU Temp" = "Pokaż temperaturę GPU";
"Show Memory" = "Pokaż pamięć";
"Show Network" = "Pokaż sieć";
"Show Network Row" = "Pokaż wiersz sieci";
"Show Network Speed Sparkline Graph below" = "Pokaż wykres prędkości sieci poniżej";
"Show Per-Core Utilization Grid below" = "Pokaż siatkę wykorzystania per-Core poniżej";
"Show Power" = "Pokaż zasilanie";
"Show Ring Details" = "Pokaż szczegóły dzwonka";
"Show Ring Labels" = "Pokaż etykiety pierścienia";
"Show Temperature" = "Pokaż temperaturę";
"Show Temperature Sparkline Graph below" = "Pokaż wykres linii temperatury poniżej";
"Show Top Processes" = "Pokaż najlepsze procesy";
"Single large value instead of max/avg stack" = "Pojedyncza duża wartość zamiast maks./vg stack";
"SMC Fan Control" = "Sterowanie wentylatorem SMC";
"Smooth Curves" = "Płynne Krzywe";
"Software" = "Oprogramowanie";
"Software Updates" = "Aktualizacje oprogramowania";
"Solarized Amber" = "Solaryzowany Bursztyn";
"Speed" = "Prędkość";
"SSD" = "SSD";
"Startup at login?" = "Uruchomić przy logowaniu?";
"Statistics" = "Statystyki";
"Storage" = "Pamięć";
"Style" = "Styl";
"Style Options" = "Opcje stylu";
"Styles & Themes" = "Styles & Themes";
"Supported by your CPU" = "Obsługiwane przez CPU";
"Sustained Duration" = "Trwały okres";
"Swap Total" = "Zamień ogółem";
"Swap Used" = "Wymiana użyta";
"System Alert Notifications" = "Powiadomienia systemowe";
"System Up to Date" = "Dotychczasowy system";
"Tahoe Glass" = "Szkło Tahoe";
"Temp" = "Tymczasowa";
"Temp Source" = "Źródło tymczasowe";
"Temperature" = "Temperatura";
"Temperature Warning Threshold" = "Próg ostrzeżenia temperatury";
"Temperature(C)" = "Temperatura (C)";
"Temperatures" = "Temperatury";
"Themes & Appearance" = "Motywy i wygląd";
"Thermal History" = "Historia termiczna";
"This application can not be launched due to AMDRyzenCPUPowerManagement is reporting incorrect data." = "Ta aplikacja nie może być uruchomiona z powodu przesyłania błędnych danych przez AMDRyzenCPUPowerManager.";
"This software interacts directly with low-level CPU hardware registers, Model-Specific Registers (MSRs), and the System Management Unit (SMU) to control CPU voltages, frequencies, and power limits.\n\nIncorrect settings, unstable undervolting, or wrong configurations can cause system instability, data loss, kernel panics, or permanent hardware damage.\n\nBy continuing, you agree that absolute responsibility for any system instability, hardware damage, or alien invasion lies entirely with the user. The authors and contributors assume no liability whatsoever for any damage, loss, or side effects to your hardware, software, or personal property. Use at your own risk." = "Oprogramowanie to wchodzi bezpośrednio w interakcje z małymi rejestrami sprzętu komputerowego CPU, rejestrami dotyczącymi modeli (MSR), oraz jednostki zarządzania systemem (SMU) do kontrolowania napięć procesora, częstotliwości i wartości granicznych mocy.\n\nNieprawidłowe ustawienia, niestabilne zaniżanie lub nieprawidłowe konfiguracje mogą spowodować niestabilność systemu, utratę danych, panikę jądrów lub trwałe obrażenia sprzętowe.\n\nKontynuując, zgadzasz się z tym, że bezwzględna odpowiedzialność za niestabilność systemu, uszkodzenia sprzętu lub inwazję obcych spoczywa wyłącznie na użytkowniku. Autorzy i współtwórcy nie ponoszą żadnej odpowiedzialności za jakiekolwiek uszkodzenia, straty lub skutki uboczne sprzętu, oprogramowania lub własności osobistej. Używaj na własne ryzyko.";
"Thread %d: %.1f%%" = "Wątek %d: %.1f%%";
"Time" = "Czas";
"Timeframe" = "Timeframe";
"Timestamp" = "Znacznik czasu";
"TMP" = "TMP";
"Todas las gráficas están ocultas." = "Todas las gráficas están ocultas.";
"Top Processes" = "Najlepsze procesy";
"Total" = "Łącznie";
"Total Power(W)" = "Całkowita moc (W)";
"Tracks active memory usage and pressure." = "Śledzi użycie i ciśnienie aktywnej pamięci.";
"Tracks CPU utilization average and core temperature." = "Śledzi średnią i temperaturę rdzenia procesora.";
"Tracks graphics memory (VRAM) utilization." = "Śledź wykorzystanie pamięci graficznej (VRAM).";
"Tracks graphics utilization and temperature." = "Śledź wykorzystanie grafiki i temperaturę.";
"Tracks primary storage capacity usage." = "Śledź podstawowe wykorzystanie pojemności magazynowej.";
"Unknown" = "Nieznane";
"Unknown GPU" = "Nieznany GPU";
"Unlock Curve Optimizer (DANGEROUS: unstable undervolting can cause kernel panic or instant reboot)" = "Odblokuj optymalizator Krzywej (DANGEROUS: niestabilne podwirowanie może spowodować panikę lub natychmiastowe ponowne uruchomienie)";
"Unlock P-State Editor (DANGEROUS: incorrect settings can crash or damage hardware)" = "Odblokuj edytor P-State (DANGEROUS: nieprawidłowe ustawienia mogą spowodować awarię lub uszkodzenie sprzętu)";
"Upload" = "Prześlij";
"Uptime" = "Czas pracy";
"Use Popover Menu" = "Użyj menu Popover";
"Used memory in GB" = "Użyta pamięć w GB";
"Used RAM" = "Used RAM";
"UTC Time" = "Czas UTC";
"V-F Operating Curve" = "Krzywa eksploatacyjna V-F";
"Value" = "Wartość";
"VDA Decoder" = "Dekoder VDA";
"Visible charts:" = "Widoczne wykresy:";
"Volt:" = "Volt:";
"VRAM" = "VRAM";
"VRAM Tracker" = "Śledzenie VRAM";
"VRAM Used" = "Używane VRAM";
"VRAM: %.2fG%@" = "VRAM: %.2fG%@";
"W" = "Pr";
"Weekday" = "Dzień tygodnia";
"Widget Reordering" = "Zmiana kolejności widżetów";
"Widget Selection & Display Style" = "Wybór widżetu i styl wyświetlania";
"Widget Style" = "Styl widżetu";
"Write Speed" = "Prędkość zapisu";
"Yes" = "Tak";
"You are running the most recent version of AMD Power Gadget (v%@)." = "Używasz najnowszej wersji Gadżetu Energii AMD (v%@).";
"You have the latest version installed (v%@)." = "Masz zainstalowaną najnowszą wersję (v%@).";
"°C" = "°C";
"Área Rellena (Gradient)" = "Powierzchnia Rellena (Gradient)";

/* Compatibility / format keys */
"Your AMDRyzenCPUPowerManagement version (%@) is outdated and no longer API compatible. Please use version 3.0.0 or newer and start this application again." = "Twoja wersja AMDRyzenCPUPowerManagement (%@) jest nieaktualna i nie jest już kompatybilna z API. Użyj wersji 3.0.0 lub nowszej i uruchom aplikację ponownie.";

/* App language picker */
"Language" = "Język";
"App Language" = "Język aplikacji";
"Choose the interface language. The app will restart to apply the change." = "Wybierz język interfejsu. Aplikacja uruchomi się ponownie, aby zastosować zmianę.";
"System Default" = "Domyślne systemowe";
"Current: %@" = "Obecnie: %@";
"Restart required" = "Wymagane ponowne uruchomienie";
"Apply & Restart" = "Zastosuj i uruchom ponownie";
"The app needs to restart to load the selected language." = "Aplikacja musi zrestartować, aby załadować wybrany język.";

/* Privilege UX */
"This action requires administrator privileges. Run AMD Power Gadget as root, or add the boot argument -amdpnopchk for debugging." = "Ta akcja wymaga uprawnień administratora. Uruchom Gadżet zasilania AMD jako root, lub dodaj argument rozruchu -amdpnopchk do debugowania.";

/* Crowdin: recent UI strings — CPPC badge vs EPP Active Mode */
"CPPC: HW OK" = "CPPC: HW OK";
"CPPC: EPP On" = "CPPC: EPP On";
"This CPU did not report CPPC support to the kext." = "This CPU did not report CPPC support to the kext.";
"If the switch snaps back to Off: enable writes with boot-arg -amdpnopchk (or run as root). The green “CPPC: HW OK” badge only means rankings exist — it is not this switch." = "If the switch snaps back to Off: enable writes with boot-arg -amdpnopchk (or run as root). The green “CPPC: HW OK” badge only means rankings exist — it is not this switch.";
"Native CPPC Active Mode (EPP) is ON. Cores scale autonomously; rankings come from the processor." = "Native CPPC Active Mode (EPP) is ON. Cores scale autonomously; rankings come from the processor.";
"CPPC hardware scores could not be read. Rankings are estimated from observed clocks. This is not the Profiles EPP toggle." = "CPPC hardware scores could not be read. Rankings are estimated from observed clocks. This is not the Profiles EPP toggle.";
"The CPU reports CPPC rankings (HW OK). That does not mean Active Mode is on — enable “Native CPPC Active Mode (EPP)” under Profiles (needs -amdpnopchk or root)." = "The CPU reports CPPC rankings (HW OK). That does not mean Active Mode is on — enable “Native CPPC Active Mode (EPP)” under Profiles (needs -amdpnopchk or root).";
/* Deprecated badge key — kept so old locales still resolve */
"CPPC: Active" = "CPPC: HW OK";

/* Menu Bar toggles (fabiosun IT) */
"Show Max Freq Only" = "Show Max Freq Only";

/* Menu Bar toggles (fabiosun IT) */
"Use Fahrenheit" = "Use Fahrenheit";

/* Menu Bar toggles (fabiosun IT) */
"Frequency column (max/avg GHz)" = "Frequency column (max/avg GHz)";

/* Menu Bar toggles (fabiosun IT) */
"CPU temp + optional GPU temp" = "CPU temp + optional GPU temp";

/* Menu Bar toggles (fabiosun IT) */
"Convert temperature values from Celsius to Fahrenheit" = "Convert temperature values from Celsius to Fahrenheit";

/* Menu Bar toggles (fabiosun IT) */
"CPU watts + optional GPU watts" = "CPU watts + optional GPU watts";

/* CPPC support gate */
"Active Mode and Auto-EPP stay off until the kext reports CPPC. Boot-arg -amdcppcactive alone is not enough if MSR/CPUID checks fail — reboot after updating kexts." = "Active Mode and Auto-EPP stay off until the kext reports CPPC. Boot-arg -amdcppcactive alone is not enough if MSR/CPUID checks fail — reboot after updating kexts.";
"AMDRyzenCPUPowerManagement kext not connected." = "AMDRyzenCPUPowerManagement kext not connected.";
"If the switch snaps back to Off: enable writes with boot-arg -amdpnopchk (or run as root). With -amdcppcactive the kext enables Active Mode at boot after reboot." = "If the switch snaps back to Off: enable writes with boot-arg -amdpnopchk (or run as root). With -amdcppcactive the kext enables Active Mode at boot after reboot.";
